In [2]:
#Merging, Joining, and Concatenating:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],                             # create a data frames
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [8]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [9]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [10]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [11]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [12]:
pd.concat([df1,df2,df3])                  # concatation fun

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [14]:
pd.concat([df1,df2,df3] ,axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [15]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
#merging:

In [16]:
left                                      # create left and right table common column key

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [17]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [20]:
pd.merge(left,right,how='inner',on='key')                # mergeing both tables

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [22]:
pd.merge(left,right,how='left',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [23]:
# another cretae data frame:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [24]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [25]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [27]:
pd.merge(left,right, on=['key1','key2'])             # inner joins

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [30]:
pd.merge(left,right,how='outer',on=['key1','key2'])        # outer join

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [31]:
pd.merge(left,right,how='left',on=['key1','key2'])       # left joins

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [ ]:
# Operations on pandas:

In [77]:
dic={'col1':[1,2,3,4],'col2':[555,666,555,333],'col3':['re','ra','ka','de']}

In [78]:
dic

{'col1': [1, 2, 3, 4],
 'col2': [555, 666, 555, 333],
 'col3': ['re', 'ra', 'ka', 'de']}

In [79]:
df=pd.DataFrame(data=dic)

In [80]:
df

   col1  col2 col3
0     1   555   re
1     2   666   ra
2     3   555   ka
3     4   333   de

In [81]:
type(df)

pandas.core.frame.DataFrame

In [82]:
#check unique Values:
df['col2']

0    555
1    666
2    555
3    333
Name: col2, dtype: int64

In [83]:
df['col2'].unique                     # check unique values

<bound method Series.unique of 0    555
1    666
2    555
3    333
Name: col2, dtype: int64>

In [53]:
df['col2'].value_counts()              # count the column values

col2
555    2
666    1
333    1
Name: count, dtype: int64

In [55]:
df['col2'].nunique()

3

In [ ]:
# Selecting Data:

In [84]:
df

   col1  col2 col3
0     1   555   re
1     2   666   ra
2     3   555   ka
3     4   333   de

In [85]:
df[df['col1']>1]             # using mutiple dunc

   col1  col2 col3
1     2   666   ra
2     3   555   ka
3     4   333   de

In [86]:
new=df[(df['col1']>2) & (df['col3'] == 'ka')]              # using & oprater:

In [87]:
new

   col1  col2 col3
2     3   555   ka

In [88]:
new1=df[(df['col1']>2) | (df['col3'] == 'ka')]              # using OR oprater

In [89]:
new1

   col1  col2 col3
2     3   555   ka
3     4   333   de

In [ ]:
# Applying Functions:

In [90]:
def even(n):                                             # Applying functions 
    return ((n % 2)==0 )

In [91]:
df['col1'].apply(even)

0    False
1     True
2    False
3     True
Name: col1, dtype: bool

In [94]:
def sqr(x):                                           # sqr aplly function 
    return ( x *2)

In [95]:
df['col1'].apply(sqr)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
#** Permanently Removing a Column**

In [96]:
df

   col1  col2 col3
0     1   555   re
1     2   666   ra
2     3   555   ka
3     4   333   de

In [99]:
df.drop(columns='col3')                    # drop comments

   col1  col2
0     1   555
1     2   666
2     3   555
3     4   333

In [100]:
df

   col1  col2 col3
0     1   555   re
1     2   666   ra
2     3   555   ka
3     4   333   de

In [102]:
# another colunm deleted
df

   col1  col2 col3
0     1   555   re
1     2   666   ra
2     3   555   ka
3     4   333   de

In [103]:
del df['col3']                                                  # del cmt for delte colnms

In [104]:
df

   col1  col2
0     1   555
1     2   666
2     3   555
3     4   333

In [106]:
# Checking tyable columns Name AND Index:
df.columns                                  # check colunms names

Index(['col1', 'col2'], dtype='object')

In [108]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
#** Sorting and Ordering a DataFrame:**

In [109]:
df

   col1  col2
0     1   555
1     2   666
2     3   555
3     4   333

In [110]:
df.sort_values(by='col2')                              # shoring or ascending orders

   col1  col2
3     4   333
0     1   555
2     3   555
1     2   666

In [ ]:
#Find Null Values or Check for Null Values

In [116]:
df.isnull()                                      # null values check

    col1   col2
0  False  False
1  False  False
2  False  False
3  False  False

In [117]:
df.dropna()

   col1  col2
0     1   555
1     2   666
2     3   555
3     4   333

In [118]:
#pivot_table concept:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [119]:
df=pd.DataFrame(data=data)

In [120]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [124]:
new=df.groupby('A').sum()

In [125]:
new

             B    C   D
A
bar  twooneone  yxy  10
foo  oneonetwo  xyx   6

In [134]:
New1=df.pivot_table(values='D',index=['A','B'],columns=['C'])

In [135]:
New1

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN